{"id":1248,"date":"2024-08-12T08:04:36","date_gmt":"2024-08-12T08:04:36","guid":{"rendered":"https:\/\/jsfij.com\/2024\/08\/12\/cat-lovescapes\/"},"modified":"2024-08-12T08:04:36","modified_gmt":"2024-08-12T08:04:36","slug":"cat-lovescapes","status":"publish","type":"post","link":"https:\/\/jsfij.com\/2024\/08\/12\/cat-lovescapes\/","title":{"rendered":"Cat Lovescapes"},"content":{"rendered":"<p>CAT LOVESCAPES is a point and click game, where YOU are in the role of angelic Cat Cupid, whose task is to help the Black cat successfully pass through the Grandma&#8217;s house. Our Grandma owns six cats, but one is the most fluffy and precious of them all. The most precious cat is the White cat, who won the furry heart of the Black cat. He needs to fight his FURR-iends , escape from Grandma, avoid every obstacle, explore and pass all the rooms in the house, and reach his love, the White cat.How to play Cat Lovescapes:😻 CATS need a distraction so the Black cat can pass easily. Use your creativity to trick them all with many entertaining point and click actions.If you fail to escape them, you will return to the beginning of the room. They will be your obstacle in each room, use your reflexes and outrun them all with a simple point and click gameplay.😻 LOVE is waiting for you in one of these numerous rooms in the house. Be persistent and go through all the levels to find your true love.😻 ESCAPE from Grandma with every click and point Black cat to exit, which is always on the right side of the room, and be one step closer to your loved one.Game features:🐾 Enter over 50 fun, various, and purr-fect rooms with stunning details in graphics and sound during the whole gameplay.🐾 Escape from old-fashioned Grandma and her challenging traps and cats. Get past all of her colorful, playful, grumpy, and sleepy cats. As going through rooms, discover other unalike animals and deal with them too!🐾 Fast and Easy gameplay &#8211; enjoy the intuitive point and click game and smooth controls.🐾 Be cat-like and show your reflexes. If you are in trouble call Cat Cupid, he&#8217;s got your back.🐾 Play the game offline and let it always be with you as your new FURR-iends.🐾 Sneak through rooms bravely even though the levels are getting harder and trickier. Stay PAWsitive 😻 and in love!Play this love-escape point and click game if you are a cat lover, sneak through all the rooms, escape from Grandma and reach your love.Guaranteed PURRfect time!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>CAT LOVESCAPES is a point and click game, where YOU are in the role of angelic Cat Cupid, whose task is to help the Black cat successfully pass through the Grandma&#8217;s house. Our Grandma owns six cats, but one is the most fluffy and precious of them all. The most precious cat is the White [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1247,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[29],"class_list":["post-1248","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-puzzles","tag-mobile"],"_links":{"self":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/posts\/1248"}],"collection":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/comments?post=1248"}],"version-history":[{"count":0,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/posts\/1248\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/media\/1247"}],"wp:attachment":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/media?parent=1248"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/categories?post=1248"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/tags?post=1248"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}