{"id":830,"date":"2024-05-06T08:21:59","date_gmt":"2024-05-06T08:21:59","guid":{"rendered":"https:\/\/jsfij.com\/privacy-policy\/"},"modified":"2024-05-06T08:21:59","modified_gmt":"2024-05-06T08:21:59","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/jsfij.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\r\n<p>Your privacy is very important to us. At Games we have a few fundamental principles that we follow:<\/p>\r\n\r\n\r\n\r\n<ul class=\"wp-block-list\"><li>We do not ask you for personal information unless we truly need it. (We can not stand services that ask you for things like your gender or income level for no apparent reason.)<\/li><li>We do not share your personal information with anyone except to comply with the law, develop our products, or protect our rights.<\/li><li>We do not store personal information on our servers unless required for the on-going operation of our site.<\/li><\/ul>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Website Visitors<\/h2>\r\n\r\n\r\n\r\n<p>Like most website operators, Games collects non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, language preference, referring site, and the date and time of each visitor request. Games is purpose in collecting non-personally identifying information is to better understand how Games is visitors use its website. From time to time, Games may release non-personally-identifying information in the aggregate, e.g., by publishing a report on trends in the usage of its website.<\/p>\r\n\r\n\r\n\r\n<p>Games also collects potentially personally-identifying information like Internet Protocol (IP) addresses for logged-in users and for users leaving comments on our blogs. Games only discloses logged-in user and commenter IP addresses under the same circumstances that it uses and discloses personally-identifying information as described below, except that blog commenter IP addresses are visible and disclosed to the administrators of the blog where the comment was left.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Gathering of Personally-Identifying Information<\/h2>\r\n\r\n\r\n\r\n<p>Certain visitors to Games is websites choose to interact with Games in ways that require Games to gather personally-identifying information. The amount and type of information that Games gathers depends on the nature of the interaction. For example, we ask visitors who comment on our blog to provide a username and email address. Those who wish to receive Games updates via email, we collect their emails. In each case, Games collects such information only insofar as is necessary or appropriate to fulfill the purpose of the visitor is interaction with Games. Games does not disclose personally-identifying information other than as described below. And visitors can always refuse to supply personally-identifying information, with the caveat that it may prevent them from engaging in certain website-related activities.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Protection of Certain Personally-Identifying Information<\/h2>\r\n\r\n\r\n\r\n<p>Games will not rent or sell potentially personally identifying and personally-identifying information to anyone. Other than to its employees, contractors, as described above, Games discloses potentially personally-identifying and personally-identifying information only in response to a subpoena, court order, or other governmental requests, or when Games believes in good faith that disclosure is reasonably necessary to protect the property or rights of Games, third parties or the public at large. If you are a registered user of an Games website and have supplied your email address, Games may occasionally send you an email to tell you about new features, solicit your feedback, or just keep you up to date with what is going on with Games and our products. We primarily use our various product blogs to communicate this type of information, so we expect to keep this type of email to a minimum. If you send us a request (for example via a support email or via one of our feedback mechanisms), we reserve the right to publish it in order to help us clarify or respond to your request or to help us support other users. Games takes all measures reasonably necessary to protect against the unauthorized access, use, alteration or destruction of potentially personally-identifying and personally-identifying information.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Cookies<\/h2>\r\n\r\n\r\n\r\n<p>A cookie is a string of information that a website stores on a visitor is a computer, and that the visitor is browser provides to the website each time the visitor returns. Games uses cookies to help Games identify and track visitors, their usage of Games website, and their website access preferences. Games visitors who do not wish to have cookies placed on their computers should set their browsers to refuse cookies before using Games is websites, with the drawback that certain features of Games is websites may not function properly without the aid of cookies.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">External Links<\/h2>\r\n\r\n\r\n\r\n<p>You should be aware that other Internet sites that are linked from the Games websites or from Games e-mail messages may contain privacy provisions that differ from the provisions of this Policy. To ensure your privacy is protected, we recommend that you review the privacy statements of these other linked sites, applications, or other digital platforms.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Ads<\/h2>\r\n\r\n\r\n\r\n<p>Ads appearing on any of our websites may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer each time they send you an online advertisement to compile information about you or others who use your computer. This information allows ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by Games and does not cover the use of cookies by any advertisers.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Comments<\/h2>\r\n\r\n\r\n\r\n<p>Comments and other content submitted to Akismet anti-spam service are not saved on our servers unless they were marked as false positives, in which case we store them long enough to use them to improve the service to avoid future false positives.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Children<\/h2>\r\n\r\n\r\n\r\n<p>We recognize the particular importance of protecting privacy where children are involved. We do not intend to collect, knowingly collect, sell, or solicit Personal Information from anyone under the age of 16. We do not target children with our services. If you are under 16, do not use or provide any information on the Website or through any of its features. If you believe that a child under the age of 16 may have provided us Personal Data online, we ask that a parent or guardian contact us at miirak@monajat.org.<\/p>\r\n\r\n\r\n\r\n<h2 class=\"wp-block-heading\">Changes to this Privacy Policy<\/h2>\r\n\r\n\r\n\r\n<p>Although most changes are likely to be minor, Games may change its Privacy Policy from time to time, and in Games is sole discretion. Games encourages visitors to frequently check this page for any changes to its Privacy Policy. Your continued use of this site after any change in this Privacy Policy will constitute your acceptance of such change.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Your privacy is very important to us. At we have a few fundamental principles that we follow: We do not ask you for personal information unless we truly need it. (We can not stand services that ask you for things like your gender or income level for no apparent reason.) We do not share your [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-830","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/pages\/830"}],"collection":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/comments?post=830"}],"version-history":[{"count":0,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/pages\/830\/revisions"}],"wp:attachment":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/media?parent=830"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}