{"id":832,"date":"2024-05-06T08:21:59","date_gmt":"2024-05-06T08:21:59","guid":{"rendered":"https:\/\/jsfij.com\/dmca\/"},"modified":"2024-05-06T08:21:59","modified_gmt":"2024-05-06T08:21:59","slug":"dmca","status":"publish","type":"page","link":"https:\/\/jsfij.com\/dmca\/","title":{"rendered":"DMCA"},"content":{"rendered":"\r\n<p>Games respects the intellectual property rights of others and expects users of the Service to do the same. Games complies with the federal Digital Millennium Copyright Act (“DMCA”), the text of which may be found on the U.S. Copyright Office Website at <a rel=\"noreferrer noopener\" href=\"http:\/\/www.copyright.gov\/legislation\/dmca.pdf\" target=\"_blank\">http:\/\/www.copyright.gov\/legislation\/dmca.pdf<\/a>. We will respond to notices of alleged copyright infringement that comply with the DMCA and other applicable law and are properly provided to us. If you believe that any Content has been copied or used in a way that constitutes copyright infringement, please provide us with the following information:<\/p>\r\n\r\n\r\n\r\n<ul class=\"wp-block-list\"><li>a physical or electronic signature of the copyright owner or a person authorized to act on their behalf;<\/li><li>identification of the copyrighted work claimed to have been infringed;<\/li><li>identification of the material that is claimed to be infringing or to be the subject of infringing activity, and information reasonably sufficient to permit us to locate the material (such as a url);<\/li><li>your contact information, including your address, telephone number, and an email address;<\/li><li>a written statement by you that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and<\/li><li>a statement that the information in the notification is accurate, and, under penalty of perjury, that you are authorized to act on behalf of the copyright owner.<\/li><\/ul>\r\n\r\n\r\n\r\n<p>If you believe that your removed Content is not actually infringing, or that you have the necessary rights to post your Content, please send us a counter-notice containing the following information:<\/p>\r\n\r\n\r\n\r\n<ul class=\"wp-block-list\"><li>a physical or electronic signature of the copyright owner or a person authorized to act on their behalf;<\/li><li>your physical or electronic signature (with your full legal name);<\/li><li>identification of the Content that has been removed or to which access has been disabled and the location at which the content appeared before it was removed or disabled;<\/li><li>a statement that you have a good faith belief, under penalty of perjury, that the Content was removed or disabled as a result of mistake or a misidentification of the Content; and<\/li><li>your name, address, telephone number, and email address, and a statement that you will accept service of process from the person who provided the original notification of the alleged infringement.<\/li><\/ul>\r\n\r\n\r\n\r\n<p>If we receive a counter-notice, we may send a copy of the counter-notice to the person alleging copyright infringement and inform that person that we may replace the removed Content. Unless the original person alleging copyright infringement files an action seeking a court order against the Content provider, member, or user, the removed Content may be replaced, in ten to fourteen business days or more after receipt of the counter-notice, at Games’s sole discretion.<\/p>\r\n\r\n\r\n\r\n<p>Please understand that filing a counter-notification may lead to legal proceedings between you and the complaining party to determine ownership. Be aware that there may be adverse legal consequences in your country if you make a false or bad faith allegation by using this process.<\/p>\r\n\r\n\r\n\r\n<p>We reserve the right to remove Content alleged to be infringing without prior notice and at our sole discretion. In appropriate circumstances.<\/p>\r\n\r\n\r\n\r\n<p>Attn: DMCA Notice<\/p>\r\n\r\n\r\n\r\n<p>Games, Individual.<br>Email: miirak@monajat.org<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>respects the intellectual property rights of others and expects users of the Service to do the same. complies with the federal Digital Millennium Copyright Act (“DMCA”), the text of which may be found on the U.S. Copyright Office Website at http:\/\/www.copyright.gov\/legislation\/dmca.pdf. We will respond to notices of alleged copyright infringement that comply with the DMCA and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-832","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/pages\/832"}],"collection":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/comments?post=832"}],"version-history":[{"count":0,"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/pages\/832\/revisions"}],"wp:attachment":[{"href":"https:\/\/jsfij.com\/wp-json\/wp\/v2\/media?parent=832"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}